In [100]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [101]:
np.random.seed(61)

In [102]:
df = pd.DataFrame(randn(5,4), index=["A","B","C","D","E"], columns=["Z","X","W","Y"])

In [103]:
df

          Z         X         W         Y
A -0.431496  0.439376 -0.001262  1.061123
B  0.203365  0.665573 -1.043615 -1.283911
C -0.041534 -1.147977 -0.125843  1.020149
D  1.029621 -0.067328 -0.599748  0.240179
E -2.205033 -0.565228  1.542494  0.681175

In [104]:
df["Z"]

A   -0.431496
B    0.203365
C   -0.041534
D    1.029621
E   -2.205033
Name: Z, dtype: float64

In [105]:
df.X

A    0.439376
B    0.665573
C   -1.147977
D   -0.067328
E   -0.565228
Name: X, dtype: float64

In [106]:
#columns
df[["X","W"]]

          X         W
A  0.439376 -0.001262
B  0.665573 -1.043615
C -1.147977 -0.125843
D -0.067328 -0.599748
E -0.565228  1.542494

In [107]:
df["T"] = df["X"] + df["W"]

In [108]:
df

          Z         X         W         Y         T
A -0.431496  0.439376 -0.001262  1.061123  0.438114
B  0.203365  0.665573 -1.043615 -1.283911 -0.378042
C -0.041534 -1.147977 -0.125843  1.020149 -1.273820
D  1.029621 -0.067328 -0.599748  0.240179 -0.667077
E -2.205033 -0.565228  1.542494  0.681175  0.977266

In [109]:
#default axis=0
df.drop("T",axis=1, inplace=True)

In [110]:
df

          Z         X         W         Y
A -0.431496  0.439376 -0.001262  1.061123
B  0.203365  0.665573 -1.043615 -1.283911
C -0.041534 -1.147977 -0.125843  1.020149
D  1.029621 -0.067328 -0.599748  0.240179
E -2.205033 -0.565228  1.542494  0.681175

In [111]:
df.drop("E")

          Z         X         W         Y
A -0.431496  0.439376 -0.001262  1.061123
B  0.203365  0.665573 -1.043615 -1.283911
C -0.041534 -1.147977 -0.125843  1.020149
D  1.029621 -0.067328 -0.599748  0.240179

In [112]:
df.shape

(5, 4)

In [113]:
#rows
df.loc["A":"C"]

          Z         X         W         Y
A -0.431496  0.439376 -0.001262  1.061123
B  0.203365  0.665573 -1.043615 -1.283911
C -0.041534 -1.147977 -0.125843  1.020149

In [114]:
df.loc["A"]["W"]

-0.001261818837753155

In [115]:
df.iloc[0]["W"]

-0.001261818837753155

In [116]:
df.iloc[0,2]

-0.001261818837753155

In [117]:
df.loc["A","W"]

-0.001261818837753155

In [118]:
df < 0

       Z      X      W      Y
A   True  False   True  False
B  False  False   True   True
C   True   True   True  False
D  False   True   True  False
E   True   True  False  False

In [119]:
df[df<0]

          Z         X         W         Y
A -0.431496       NaN -0.001262       NaN
B       NaN       NaN -1.043615 -1.283911
C -0.041534 -1.147977 -0.125843       NaN
D       NaN -0.067328 -0.599748       NaN
E -2.205033 -0.565228       NaN       NaN

In [120]:
df2=df[df<0]

In [121]:
df[df["W"]>0.2]

          Z         X         W         Y
E -2.205033 -0.565228  1.542494  0.681175

In [122]:
df[df["W"]>0.2]["Z"]

E   -2.205033
Name: Z, dtype: float64

In [123]:
df[df["W"]>0.2]["X"]

E   -0.565228
Name: X, dtype: float64

In [124]:
df[(df["W"]>0.2) | (df["Y"] < 0)]

          Z         X         W         Y
B  0.203365  0.665573 -1.043615 -1.283911
E -2.205033 -0.565228  1.542494  0.681175

In [125]:
df[(df["W"]>0.2) | (df["Y"] < 0)].loc["E"]

Z   -2.205033
X   -0.565228
W    1.542494
Y    0.681175
Name: E, dtype: float64

In [126]:
df.reset_index()

  index         Z         X         W         Y
0     A -0.431496  0.439376 -0.001262  1.061123
1     B  0.203365  0.665573 -1.043615 -1.283911
2     C -0.041534 -1.147977 -0.125843  1.020149
3     D  1.029621 -0.067328 -0.599748  0.240179
4     E -2.205033 -0.565228  1.542494  0.681175

In [127]:
new_idx = "AA BB CC DD EE".split()

In [128]:
new_idx

['AA', 'BB', 'CC', 'DD', 'EE']

In [129]:
df["idx"] = new_idx

In [130]:
df.set_index("idx")

            Z         X         W         Y
idx
AA  -0.431496  0.439376 -0.001262  1.061123
BB   0.203365  0.665573 -1.043615 -1.283911
CC  -0.041534 -1.147977 -0.125843  1.020149
DD   1.029621 -0.067328 -0.599748  0.240179
EE  -2.205033 -0.565228  1.542494  0.681175

In [131]:
df

          Z         X         W         Y idx
A -0.431496  0.439376 -0.001262  1.061123  AA
B  0.203365  0.665573 -1.043615 -1.283911  BB
C -0.041534 -1.147977 -0.125843  1.020149  CC
D  1.029621 -0.067328 -0.599748  0.240179  DD
E -2.205033 -0.565228  1.542494  0.681175  EE

In [132]:
#multiIndex
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.126455 -1.380276
   2 -0.740067 -0.428134
   3  0.115608  0.501836
G2 1 -0.089718  0.872918
   2 -0.618638 -1.962668
   3  1.450724 -2.193230

In [133]:
df.loc["G1"].loc[1]

A    0.126455
B   -1.380276
Name: 1, dtype: float64

In [134]:
df.index.names

FrozenList([None, None])

In [135]:
df.index.names = ["X","Y"]
df

             A         B
X  Y
G1 1  0.126455 -1.380276
   2 -0.740067 -0.428134
   3  0.115608  0.501836
G2 1 -0.089718  0.872918
   2 -0.618638 -1.962668
   3  1.450724 -2.193230

In [136]:
df.loc["G1"].loc[1]["B"]

-1.3802756411648192

In [137]:
df.xs("G1")

          A         B
Y
1  0.126455 -1.380276
2 -0.740067 -0.428134
3  0.115608  0.501836

In [138]:
df.xs(1,level="Y")

           A         B
X
G1  0.126455 -1.380276
G2 -0.089718  0.872918

In [150]:
df2["Y"].loc["B"]=np.nan
df2

          Z         X         W   Y
A -0.431496       NaN -0.001262 NaN
B       NaN       NaN -1.043615 NaN
C -0.041534 -1.147977 -0.125843 NaN
D       NaN -0.067328 -0.599748 NaN
E -2.205033 -0.565228       NaN NaN

In [149]:
df2.dropna()

Empty DataFrame
Columns: [Z, X, W, Y]
Index: []

In [151]:
df2.dropna(thresh=2)

          Z         X         W   Y
A -0.431496       NaN -0.001262 NaN
C -0.041534 -1.147977 -0.125843 NaN
D       NaN -0.067328 -0.599748 NaN
E -2.205033 -0.565228       NaN NaN

In [153]:
df2.dropna(how="all", axis=1)

          Z         X         W
A -0.431496       NaN -0.001262
B       NaN       NaN -1.043615
C -0.041534 -1.147977 -0.125843
D       NaN -0.067328 -0.599748
E -2.205033 -0.565228       NaN

In [156]:
df2.fillna(333)

            Z           X           W      Y
A   -0.431496  333.000000   -0.001262  333.0
B  333.000000  333.000000   -1.043615  333.0
C   -0.041534   -1.147977   -0.125843  333.0
D  333.000000   -0.067328   -0.599748  333.0
E   -2.205033   -0.565228  333.000000  333.0

In [157]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [159]:
df = pd.DataFrame(data)

In [160]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [162]:
byc=df.groupby("Company")

In [163]:
byc.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [164]:
byc.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [166]:
df.groupby("Company").sum().iloc[1]

Sales    320
Name: GOOG, dtype: int64

In [167]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [168]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [169]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [170]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [171]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [172]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [173]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [174]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [175]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [176]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [177]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [178]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [179]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [180]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [184]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [185]:
df["col2"].nunique()

3

In [186]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [188]:
df["col1"].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [189]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [190]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [191]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [192]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [193]:
df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [194]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [195]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [196]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [197]:
#pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

In [198]:
# Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects

#You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:
#conda install lxml
#conda install html5lib
#conda install BeautifulSoup4

#df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [199]:
#sqlite

#from sqlalchemy import create_engine
#engine = create_engine('sqlite:///:memory:')
#df.to_sql('data', engine)
#sql_df = pd.read_sql('data',con=engine)